; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v4 ?v1)
             (pred_12 ?v10 ?v7)
             (pred_6 ?v4 ?v7)
             (pred_4 ?v12 ?v4 )
	     (pred_2 ?v4)
             (pred_1 ?v9)
             (pred_10 ?v10)
             (pred_8 ?v7)
             (pred_11 ?v4)
             (pred_7 ?v10)
             (pred_9 ?v4)
             (pred_5 ))



(:action op_2
:parameters (?v5 ?v2 ?v11 ?v8)
:precondition (and (pred_1 ?v5) (pred_1 ?v2) (pred_10 ?v11) (pred_8 ?v8)
          (pred_3 ?v5 ?v2) (pred_12 ?v11 ?v8)
                   (pred_6 ?v2 ?v8) (pred_2 ?v5) 
                   (pred_11 ?v2) (pred_7 ?v11))
:effect (and  (pred_9 ?v2) (not (pred_11 ?v2))))


(:action op_4
:parameters (?v5 ?v13)
:precondition (and (pred_1 ?v5) (pred_1 ?v13)
               (pred_2 ?v5) (pred_3 ?v5 ?v13) (pred_9 ?v13))
:effect (and (pred_2 ?v13) (not (pred_2 ?v5))))

(:action op_3
:parameters (?v5 ?v11)
:precondition (and (pred_1 ?v5) (pred_10 ?v11) 
                  (pred_2 ?v5) (pred_4 ?v11 ?v5) (pred_5 ))
:effect (and (pred_7 ?v11)
   (not (pred_4 ?v11 ?v5)) (not (pred_5 ))))


(:action op_1
:parameters (?v5 ?v6 ?v3)
:precondition (and (pred_1 ?v5) (pred_10 ?v6) (pred_10 ?v3)
                  (pred_2 ?v5) (pred_7 ?v3) (pred_4 ?v6 ?v5))
:effect (and (pred_7 ?v6) (pred_4 ?v3 ?v5)
        (not (pred_7 ?v3)) (not (pred_4 ?v6 ?v5))))

(:action op_5
:parameters (?v5 ?v11)
:precondition (and (pred_1 ?v5) (pred_10 ?v11) 
                  (pred_2 ?v5) (pred_7 ?v11))
:effect (and (pred_5 ) (pred_4 ?v11 ?v5) (not (pred_7 ?v11)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_16 obj_13 obj_03 obj_18 obj_23 obj_14 obj_31 obj_25 obj_05 obj_12 obj_07 obj_01 obj_02 obj_27 obj_19 obj_20 obj_24 obj_11 obj_09 obj_15 obj_10 obj_08 obj_22 obj_21 obj_30
    obj_06 obj_04 obj_26
    obj_28 obj_29 obj_17
    )

    (:init
       (pred_5)

       (pred_1 obj_16)
       (pred_1 obj_13)
       (pred_1 obj_03)
       (pred_1 obj_18)
       (pred_1 obj_23)
       (pred_1 obj_14)
       (pred_1 obj_31)
       (pred_1 obj_25)
       (pred_1 obj_05)
       (pred_1 obj_12)
       (pred_1 obj_07)
       (pred_1 obj_01)
       (pred_1 obj_02)
       (pred_1 obj_27)
       (pred_1 obj_19)
       (pred_1 obj_20)
       (pred_1 obj_24)
       (pred_1 obj_11)
       (pred_1 obj_09)
       (pred_1 obj_15)
       (pred_1 obj_10)
       (pred_1 obj_08)
       (pred_1 obj_22)
       (pred_1 obj_21)
       (pred_1 obj_30)
       (pred_8 obj_06)
       (pred_8 obj_04)
       (pred_8 obj_26)
       (pred_10 obj_28)
       (pred_10 obj_29)
       (pred_10 obj_17)

       (pred_3 obj_16 obj_14)
       (pred_3 obj_16 obj_13)
       (pred_3 obj_13 obj_31)
       (pred_3 obj_13 obj_03)
       (pred_3 obj_13 obj_16)
       (pred_3 obj_03 obj_25)
       (pred_3 obj_03 obj_18)
       (pred_3 obj_03 obj_13)
       (pred_3 obj_18 obj_05)
       (pred_3 obj_18 obj_23)
       (pred_3 obj_18 obj_03)
       (pred_3 obj_23 obj_12)
       (pred_3 obj_23 obj_18)
       (pred_3 obj_14 obj_07)
       (pred_3 obj_14 obj_31)
       (pred_3 obj_14 obj_16)
       (pred_3 obj_31 obj_01)
       (pred_3 obj_31 obj_25)
       (pred_3 obj_31 obj_13)
       (pred_3 obj_31 obj_14)
       (pred_3 obj_25 obj_02)
       (pred_3 obj_25 obj_05)
       (pred_3 obj_25 obj_03)
       (pred_3 obj_25 obj_31)
       (pred_3 obj_05 obj_27)
       (pred_3 obj_05 obj_12)
       (pred_3 obj_05 obj_18)
       (pred_3 obj_05 obj_25)
       (pred_3 obj_12 obj_19)
       (pred_3 obj_12 obj_23)
       (pred_3 obj_12 obj_05)
       (pred_3 obj_07 obj_20)
       (pred_3 obj_07 obj_01)
       (pred_3 obj_07 obj_14)
       (pred_3 obj_01 obj_24)
       (pred_3 obj_01 obj_02)
       (pred_3 obj_01 obj_31)
       (pred_3 obj_01 obj_07)
       (pred_3 obj_02 obj_11)
       (pred_3 obj_02 obj_27)
       (pred_3 obj_02 obj_25)
       (pred_3 obj_02 obj_01)
       (pred_3 obj_27 obj_09)
       (pred_3 obj_27 obj_19)
       (pred_3 obj_27 obj_05)
       (pred_3 obj_27 obj_02)
       (pred_3 obj_19 obj_15)
       (pred_3 obj_19 obj_12)
       (pred_3 obj_19 obj_27)
       (pred_3 obj_20 obj_10)
       (pred_3 obj_20 obj_24)
       (pred_3 obj_20 obj_07)
       (pred_3 obj_24 obj_08)
       (pred_3 obj_24 obj_11)
       (pred_3 obj_24 obj_01)
       (pred_3 obj_24 obj_20)
       (pred_3 obj_11 obj_22)
       (pred_3 obj_11 obj_09)
       (pred_3 obj_11 obj_02)
       (pred_3 obj_11 obj_24)
       (pred_3 obj_09 obj_21)
       (pred_3 obj_09 obj_15)
       (pred_3 obj_09 obj_27)
       (pred_3 obj_09 obj_11)
       (pred_3 obj_15 obj_30)
       (pred_3 obj_15 obj_19)
       (pred_3 obj_15 obj_09)
       (pred_3 obj_10 obj_08)
       (pred_3 obj_10 obj_20)
       (pred_3 obj_08 obj_22)
       (pred_3 obj_08 obj_24)
       (pred_3 obj_08 obj_10)
       (pred_3 obj_22 obj_21)
       (pred_3 obj_22 obj_11)
       (pred_3 obj_22 obj_08)
       (pred_3 obj_21 obj_30)
       (pred_3 obj_21 obj_09)
       (pred_3 obj_21 obj_22)
       (pred_3 obj_30 obj_15)
       (pred_3 obj_30 obj_21)
       (pred_11 obj_18)
       (pred_11 obj_27)
       (pred_11 obj_25)
       (pred_6  obj_18 obj_06)
       (pred_6  obj_27 obj_04)
       (pred_6  obj_25 obj_26)
       (pred_9 obj_16)
       (pred_9 obj_13)
       (pred_9 obj_03)
       (pred_9 obj_23)
       (pred_9 obj_14)
       (pred_9 obj_31)
       (pred_9 obj_05)
       (pred_9 obj_12)
       (pred_9 obj_07)
       (pred_9 obj_01)
       (pred_9 obj_02)
       (pred_9 obj_19)
       (pred_9 obj_20)
       (pred_9 obj_24)
       (pred_9 obj_11)
       (pred_9 obj_09)
       (pred_9 obj_15)
       (pred_9 obj_10)
       (pred_9 obj_08)
       (pred_9 obj_22)
       (pred_9 obj_21)
       (pred_9 obj_30)

       (pred_12  obj_28 obj_06)
       (pred_12  obj_29 obj_04)
       (pred_12  obj_17 obj_26)
       (pred_4 obj_28 obj_24)
       (pred_4 obj_29 obj_19)
       (pred_4 obj_17 obj_15)
       (pred_2 obj_31)
    )

    (:goal (and
       (pred_4 obj_28 obj_14)
       (pred_4 obj_29 obj_12)
       (pred_4 obj_17 obj_12)
    ))
(:constraints
  (always (not (pred_2 obj_05)))
)
)

; plan
1. (op_4 obj_31 obj_01)
   deleted: (pred_2 obj_31)
   added: (pred_2 obj_01)
   goals met: 0 of 3
2. (op_4 obj_01 obj_24)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_24)
   goals met: 0 of 3
3. (op_3 obj_24 obj_28)
   deleted: (pred_4 obj_28 obj_24) (pred_5)
   added: (pred_7 obj_28)
   goals met: 0 of 3
4. (op_4 obj_24 obj_11)
   deleted: (pred_2 obj_24)
   added: (pred_2 obj_11)
   goals met: 0 of 3
5. (op_4 obj_11 obj_09)
   deleted: (pred_2 obj_11)
   added: (pred_2 obj_09)
   goals met: 0 of 3
6. (op_4 obj_09 obj_15)
   deleted: (pred_2 obj_09)
   added: (pred_2 obj_15)
   goals met: 0 of 3
7. (op_1 obj_15 obj_17 obj_28)
   deleted: (pred_7 obj_28) (pred_4 obj_17 obj_15)
   added: (pred_7 obj_17) (pred_4 obj_28 obj_15)
   goals met: 0 of 3
8. (op_4 obj_15 obj_19)
   deleted: (pred_2 obj_15)
   added: (pred_2 obj_19)
   goals met: 0 of 3
9. (op_1 obj_19 obj_29 obj_17)
   deleted: (pred_7 obj_17) (pred_4 obj_29 obj_19)
   added: (pred_7 obj_29) (pred_4 obj_17 obj_19)
   goals met: 0 of 3
10. (op_4 obj_19 obj_12)
   deleted: (pred_2 obj_19)
   added: (pred_2 obj_12)
   goals met: 0 of 3
11. (op_5 obj_12 obj_29)
   deleted: (pred_7 obj_29)
   added: (pred_5) (pred_4 obj_29 obj_12)
   goals met: 1 of 3
12. (op_4 obj_12 obj_19)
   deleted: (pred_2 obj_12)
   added: (pred_2 obj_19)
   goals met: 1 of 3
13. (op_3 obj_19 obj_17)
   deleted: (pred_4 obj_17 obj_19) (pred_5)
   added: (pred_7 obj_17)
   goals met: 1 of 3
14. (op_4 obj_19 obj_12)
   deleted: (pred_2 obj_19)
   added: (pred_2 obj_12)
   goals met: 1 of 3
15. (op_5 obj_12 obj_17)
   deleted: (pred_7 obj_17)
   added: (pred_5) (pred_4 obj_17 obj_12)
   goals met: 2 of 3
16. (op_4 obj_12 obj_19)
   deleted: (pred_2 obj_12)
   added: (pred_2 obj_19)
   goals met: 2 of 3
17. (op_4 obj_19 obj_15)
   deleted: (pred_2 obj_19)
   added: (pred_2 obj_15)
   goals met: 2 of 3
18. (op_3 obj_15 obj_28)
   deleted: (pred_4 obj_28 obj_15) (pred_5)
   added: (pred_7 obj_28)
   goals met: 2 of 3
19. (op_4 obj_15 obj_09)
   deleted: (pred_2 obj_15)
   added: (pred_2 obj_09)
   goals met: 2 of 3
20. (op_4 obj_09 obj_11)
   deleted: (pred_2 obj_09)
   added: (pred_2 obj_11)
   goals met: 2 of 3
21. (op_4 obj_11 obj_02)
   deleted: (pred_2 obj_11)
   added: (pred_2 obj_02)
   goals met: 2 of 3
22. (op_4 obj_02 obj_01)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_01)
   goals met: 2 of 3
23. (op_4 obj_01 obj_31)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_31)
   goals met: 2 of 3
24. (op_4 obj_31 obj_14)
   deleted: (pred_2 obj_31)
   added: (pred_2 obj_14)
   goals met: 2 of 3
25. (op_5 obj_14 obj_28)
   deleted: (pred_7 obj_28)
   added: (pred_5) (pred_4 obj_28 obj_14)
   goals met: 3 of 3
